import re
import hg

HAN_CHO = ['ㄱ', 'ㄲ', 'ㄴ', 'ㄷ', 'ㄸ', 'ㄹ', 'ㅁ', 'ㅂ', 'ㅃ', 'ㅅ',
           'ㅆ', 'ㅇ', 'ㅈ', 'ㅉ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ']
HAN_JUNG = ['ㅏ', 'ㅐ', 'ㅑ', 'ㅒ', 'ㅓ', 'ㅔ', 'ㅕ', 'ㅖ', 'ㅗ', 'ㅘ',
            'ㅙ', 'ㅚ', 'ㅛ', 'ㅜ', 'ㅝ', 'ㅞ', 'ㅟ', 'ㅠ', 'ㅡ', 'ㅢ',
            'ㅣ']
HAN_JONG = ['  ', 'ㄱ', 'ㄲ', 'ㄳ', 'ㄴ', 'ㄵ', 'ㄶ', 'ㄷ', 'ㄹ', 'ㄺ',
            'ㄻ', 'ㄼ', 'ㄽ', 'ㄾ', 'ㄿ', 'ㅀ', 'ㅁ', 'ㅂ', 'ㅄ', 'ㅅ',
            'ㅆ', 'ㅇ', 'ㅈ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ']

txt = input("낱자를 분석할 한글 완성자 문자열을 입력하세요: ")
rtxt = re.sub(r'[^가-힣]', '', txt)  # 한글 완성자만 남김

print("+----+--------+--------+-------+")
print("|글자| 초중종 |    Hex |   Dec |")
print("+----+--------+--------+-------+")

for c in rtxt:
    cc = ord(c) - 44032  # 한글 완성자의 유니코드 포인터 값 추출
    cho = cc // (21 * 28)  # 초성 값 추출
    jung = (cc // 28) % 21  # 중성 값 추출
    jong = cc % 28  # 종성 값 추출


    print("| %s | %s%s%s |" % (c, HAN_CHO[cho], HAN_JUNG[jung], HAN_JONG[jong]), end="")
    print(" 0x%s | %5d |" % (hex(cc + 44032).upper()[-4:], cc + 44032))

print("+----+--------+--------+-------+")